eisup_2019_docmng_integration/src/Catalogs/НастройкиОбменаДанными/НастройкиОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиОбменаДанными</name>
  <attributes>
    <name>УзелИнформационнойБазы</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНастройки</name>
    <type>
      <types>EnumRef.ТипыАвтоматическогоОбменаДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводитьПриемСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводитьОтправкуСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭлементовВТранзакцииНаВыгрузкуДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭлементовВТранзакцииНаЗагрузкуДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьАрхивациюФайловОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольНаОтправку</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольНаПрием</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОбменаИнформацией</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FTPАдресОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортFTPСоединения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательFTPСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольFTPСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйРазмерОтправляемогоПолучаемогоПакетаЧерезFTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассивноеFTPСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдресПолучателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьПриемаОтправкиСообщений</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическиЗакачиватьПочтуПриОбмене</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйРазмерОтправляемогоПакетаЧерезПочту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелФоновогоОбмена</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОбменаДляПриемника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлениеОбъектовИзФоновогоОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъектовДляФоновогоОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OnLineОбмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнформационнойБазыДляПодключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИнформационнойБазыНаСервереДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindowsИнформационнойБазыДляПодключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладкиOnLineОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаПротоколаОбменаOnLineОбмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУзлаИнформационнойБазы</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОтправкиСообщенияОбОшибке</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляОтправкиСообщенийОбОшибке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПослеОшибкиОтложенногоПроведенияПрекратитьОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОшибокОтложенногоПроведенияДляПрекращенияОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьДействияПодПолнымиПравами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводитьОтправкуТолькоПриУспешномПриеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнитьОтложенноеПроведениеДокументовПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПроксиFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПроксиFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверПроксиFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортПроксиFTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколПроксиFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СообщенияНеЯвляющиесяОшибками</name>
    <attributes>
      <name>ТекстСообщения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаВариантовПоискаОбъектов</name>
    <attributes>
      <name>КодПравилаОбмена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПравилаОбмена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНастройкиДляАлгоритма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНастройкиДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеНастройкиДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоНастройкаДляВыгрузки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаНеПоддерживается</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПоискаНеПоддерживается</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаВыгрузкиДанных</name>
    <attributes>
      <name>КодПравилаВыгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПравилаВыгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПравилаОбмена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоНастройкаДляВыгрузки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаНеПоддерживается</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПоСсылке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/InformationRegisters/ПараметрыОбменаДанными/ПараметрыОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыОбменаДанными</name>
  <resources>
    <name>ДатаПоследнегоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоФайлаОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьПриПервомВходеВСистему</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступностьКаталогаПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НастройкаОбменаДанными</name>
    <type>
      <types>CatalogRef.НастройкиВыполненияОбмена</types>
      <types>CatalogRef.НастройкиОбменаДанными</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ТипыАвтоматическогоОбменаДанными/ТипыАвтоматическогоОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАвтоматическогоОбменаДанными</name>
  <enumValues>
    <name>ОбменЧерезФайловыйРесурс</name>
  </enumValues>
  <enumValues>
    <name>ОбменЧерезFTPРесурс</name>
  </enumValues>
  <enumValues>
    <name>ОбменЧерезПочту</name>
  </enumValues>
  <enumValues>
    <name>ОбменЧерезComСоединение</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/НастройкиОбменаДанными/ObjectModule.bsl
// при записи
Процедура ПриЗаписи(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	// надо проверить наличие одной записи в регистре сведений
	НаборЗаписейПараметров = РегистрыСведений.ПараметрыОбменаДанными.СоздатьНаборЗаписей();
		
	НаборЗаписейПараметров.Отбор.НастройкаОбменаДанными.Установить(Ссылка);	
			
	НаборЗаписейПараметров.Прочитать();
		
	Если НаборЗаписейПараметров.Количество() = 1 Тогда
		// запись есть, ничего делать не надо
		Возврат;
	КонецЕсли;
	
	// добавляем только одну запись и все
	ЗаписьДатПараметров = НаборЗаписейПараметров.Добавить();
	ЗаписьДатПараметров.НастройкаОбменаДанными = Ссылка;
		
	Попытка
		НаборЗаписейПараметров.Записать();
	Исключение
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при записи изменений в настройку обмена """ + Ссылка + """ : " + ОписаниеОшибки(), Отказ);
	КонецПопытки;	
				
КонецПроцедуры

Функция ПолучитьДлинуСтрокиХранилища(Хранилище) Экспорт
	
	ТекстПравилаОбмена = Хранилище.Получить();
	РазмерСтроки = СтрДлина(ТекстПравилаОбмена);
	Возврат РазмерСтроки;
	
КонецФункции

// Перед записью
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	БазоваяПоставка = (Найти(ВРег(Метаданные.Имя), "БАЗОВАЯ") > 0);
	
	Если ПустаяСтрока(ВерсияПлатформыИнформационнойБазыДляПодключения) Тогда
		ВерсияПлатформыИнформационнойБазыДляПодключения = "V81";		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ТипНастройки) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено поле ""Тип настройки""", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено поле ""Узел""", Отказ);
	КонецЕсли;
	
	Если БазоваяПоставка
		И ПроцедурыОбменаДанными.ОпределитьПоУзлуОбменаЭтоРИБ(УзелИнформационнойБазы) Тогда
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("В базовой версии недоступен обмен через распределенную информационную базу", Отказ);	
		
	КонецЕсли;
	
	ЭтотУзелОбмена = ПроцедурыОбменаДанными.ПолучитьТекущийУзелИБ(УзелИнформационнойБазы);
	Если ЭтотУзелОбмена = УзелИнформационнойБазы Тогда
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("В качестве узла обмена выбран узел, соответствующий текущей информационной базе.", Отказ);
				
	КонецЕсли;
	
	Если OnLineОбмен Тогда
		
		РазмерОсновногоХранилищаПравил = ПолучитьДлинуСтрокиХранилища(ПравилаОбмена);
		
		Если (ПроизводитьПриемСообщений
			ИЛИ ПроизводитьОтправкуСообщений)
			И РазмерОсновногоХранилищаПравил = 0 Тогда
			
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заданы правила обмена данными для выгрузки в базу обмена", Отказ);		
			
		КонецЕсли;			
		
		Если ТипНастройки = Перечисления.ТипыАвтоматическогоОбменаДанными.ОбменЧерезComСоединение Тогда
						
			Если БазоваяПоставка Тогда
				
				ttk_ОбщегоНазначения.СообщитьОбОшибке("В базовой версии недоступен Режим обмена через COM - соединение", Отказ);	
				
			КонецЕсли;			
			
			Если ПроизводитьПриемСообщений Тогда
			
				РазмерХранилищаПравилЗагрузки = ПолучитьДлинуСтрокиХранилища(ПравилаОбменаДляПриемника);
				
				Если РазмерХранилищаПравилЗагрузки = 0 Тогда
					
					ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заданы правила для выгрузки из базы обмена в текущую базу", Отказ);		
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипИнформационнойБазыДляПодключения Тогда
				
				Если НЕ ЗначениеЗаполнено(КаталогИнформационнойБазыДляПодключения) Тогда
					ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено поле ""Каталог информационной базы для подключения""", Отказ);
				КонецЕсли;
				
			Иначе
				
				Если НЕ ЗначениеЗаполнено(ИмяСервераИнформационнойБазыДляПодключения) Тогда
					ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено поле ""Сервер 1С:Предприятия""", Отказ);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ИмяИнформационнойБазыНаСервереДляПодключения) Тогда
					ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено поле ""Имя информационной базы""", Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если ТипНастройки = Перечисления.ТипыАвтоматическогоОбменаДанными.ОбменЧерезComСоединение Тогда
		
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Режим обмена через COM - соединение возможно только для обмена по правилам обмена", Отказ);		
			
		КонецЕсли;
		
	КонецЕсли;	
				
	// в зависимости от типа настройки очищаем настройки остальных типов
	Если ТипНастройки = Перечисления.ТипыАвтоматическогоОбменаДанными.ОбменЧерезФайловыйРесурс Тогда
		
		КаталогОбменаИнформацией = СокрЛП(КаталогОбменаИнформацией);
						
	ИначеЕсли ТипНастройки = Перечисления.ТипыАвтоматическогоОбменаДанными.ОбменЧерезFTPРесурс Тогда
		
		Если ПустаяСтрока(ПользовательFTPСоединения) Тогда
			ПарольFTPСоединения = "";	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПортFTPСоединения) Тогда
			ПортFTPСоединения = 21;	
		КонецЕсли;
					
	КонецЕсли;
	
	Если НЕ ПроизводитьПриемСообщений
		ИЛИ НЕ ПроизводитьОтправкуСообщений Тогда
		
		ПроизводитьОтправкуТолькоПриУспешномПриеме = Ложь;	
		
	КонецЕсли;
		
	Если Не Отказ Тогда 
		ТипУзлаИнформационнойБазы = Новый(ТипЗнч(УзелИнформационнойБазы));
	КонецЕсли;
			
КонецПроцедуры
